app/controllers/songs_controller.rb

  def index
    if params[:artist_id]

    else
      @songs = Song.all
---
SELECT "songs".* FROM "songs"